Revit 2027 API
RebarBarType.SetHookLength Method
 Identifies the hook length for a hook type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetHookLength(
	ElementId hookId,
	double hookLength
)
Public Sub SetHookLength (
	hookId As ElementId,
	hookLength As Double
)
public:
void SetHookLength(
	ElementId^ hookId,
	double hookLength
)
member SetHookLength :
        hookId : ElementId *
        hookLength : float -> unit
Parameters
hookId ElementId
 id of the hook type
hookLength Double
 The hook length for a hook type
Exceptions
Exception | Condition
ArgumentException |  the rebar hook type id hookId is not valid
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace